# Pandas Kütüphanesine Dış Kaynaklı Veri Girişi

### CSV ve TXT Dosyaları İle Veri Girişi

In [1]:
import pandas as pd

In [11]:
pd.read_csv("csv_example_data.csv")

       VAL1      VAL2      VAL3      VAL4      VAL5
0  2.706850  0.628133  0.907969  0.503826  0.651118
1 -0.319318 -0.848077  0.605965 -2.018168  0.740122
2  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3  0.955057  0.190794  1.978757  2.605967  0.683509
4  0.302665  1.693723 -1.706086 -1.159119 -0.134841
5  0.390528  0.166905  0.184502  0.807706  0.072960

### Hata-1:

# read_csv'de sep="," parametresi öntanım olarak virgüldür.Öntanımlı olarak csv dosyası içerisinde değerler virgül ile "," ayrılması gerekirken noktalı virgül ile ";" ayrıldığı için direkt olarak DF yapısında dosyayı açarken bu şekilde hatalı bir gösterimle karşı karşıya geliriz.

In [48]:
pd.read_csv("csv_example_data_2.csv")

     employee;department;Year
0     Julia;Data Science;2005
1  Marie;Web Development;2008
2      Adam;Data Science;2011
3  Nicole;Cyber Security;2002
4   Joseph;App Developer;2007
5     Kayra;Data Science;2008

# Yukarıdaki kod satırında belirttiğimiz hatayı almamak için sep=";" parametresi içerisine csv dosyasında değerler hangi özel işaret ile ayrılmışsa onu yazdık.Ve hatalı gösterim düzeldi.

In [21]:
pd.read_csv("csv_example_data_2.csv", sep=";")

  employee       department  Year
0    Julia     Data Science  2005
1    Marie  Web Development  2008
2     Adam     Data Science  2011
3   Nicole   Cyber Security  2002
4   Joseph    App Developer  2007
5    Kayra     Data Science  2008

# sep="" parametresi yerine delimiter="" parametresi de alternatif olarak kullanılabilir.

In [29]:
pd.read_csv("csv_example_data_2.csv", delimiter=";")

  employee       department  Year
0    Julia     Data Science  2005
1    Marie  Web Development  2008
2     Adam     Data Science  2011
3   Nicole   Cyber Security  2002
4   Joseph    App Developer  2007
5    Kayra     Data Science  2008

### Hata-2:

In [17]:
pd.read_csv("csv_example_data_3.csv")

   Unnamed: 0 employee       department  Year
0           0    Julia     Data Science  2005
1           1    Marie  Web Development  2008
2           2     Adam     Data Science  2011
3           3   Nicole   Cyber Security  2002
4           4   Joseph    App Developer  2007
5           5    Kayra     Data Science  2008

# index_col=0 parametresini kullanarak 0.indekste yer alan sütunu DF'in indeksi olarak atamış olduk.

In [57]:
pd.read_csv("csv_example_data_3.csv", index_col=0)

  employee       department  Year
0    Julia     Data Science  2005
1    Marie  Web Development  2008
2     Adam     Data Science  2011
3   Nicole   Cyber Security  2002
4   Joseph    App Developer  2007
5    Kayra     Data Science  2008

### Hata-3:

# txt dosyası içerisinde yer alan değerler virgülle ayrılması gerekirken aralarında boşluk karakteri kullanılarak ayrılmış.Bu yüzden ifadeyi read_csv() fonksiyonu ile DF yapsında görmeye çalışırken aşağıdaki şekilde hatalı bir gösterimle karşı karşıya gelmiş oluruz.

In [90]:
df3 = pd.read_csv("example_text_data.txt")

In [92]:
df3

  VAL1 VAL2
0    10 100
1    25 250
2    30 300
3      5 50
4      8 80
5      3 30
6    15 150
7      7 70
8      6 60

# Bildiğimiz üzere bu hatayı gidermek için öntanımlı değeri virgül "," olan sep="" parametresini, txt dosyası içerisinde yer alan değerler hangi karakter ile ayrılmışsa onu sep="" parametresi içerisine yazarız ve hatayı gidermiş oluruz.

In [87]:
df3 = pd.read_csv("example_text_data.txt", sep = " ")
df3

   VAL1  VAL2
0    10   100
1    25   250
2    30   300
3     5    50
4     8    80
5     3    30
6    15   150
7     7    70
8     6    60

# Aynı işlemi delimiter parametresini kullanarak da yapabiliriz.

In [99]:
df4 = pd.read_csv("example_text_data.txt", delimiter = " ")
df4

   VAL1  VAL2
0    10   100
1    25   250
2    30   300
3     5    50
4     8    80
5     3    30
6    15   150
7     7    70
8     6    60

## Excel Dosyaları İle Veri Girişi

In [103]:
import pandas as pd

In [105]:
df_excel1 = pd.read_excel("excel_example_data.xlsx")

In [107]:
df_excel1

  employee       department  Year
0    Julia     Data Science  2005
1    Marie  Web Development  2008
2     Adam     Data Science  2011
3   Nicole   Cyber Security  2002
4   Joseph    App Developer  2007
5    Kayra     Data Science  2008

# read_excel() fonksiyonu içerisine yazarak içe aktaracağımız excel dosyasının çoklu sayfalardan oluşması halinde, sheet_name="" parametresi içerisine hangi excel sayfasını içe aktarmak istiyorsak o sayfanın Excel'deki ismini yazarız ve sonrasında gerekli dönüşüm ve işlemleri yapabiliriz.

In [112]:
df_excel2 = pd.read_excel("excel_example_data.xlsx", sheet_name="Sheet2")

In [114]:
df_excel2

  employee  age
0    Julia   35
1    Marie   40
2     Adam   38
3   Nicole   33
4   Joseph   29
5    Kayra   27

# Her iki DF içerisinde de ortak sütun bulunduğu için bu ayrı DF'leri pd.merge() fonksiyonunu kullanarak ortak sütunları üzerinden birleştirmiş olduk.

In [128]:
df_excel_merge = pd.merge(df_excel1, df_excel2, how = "inner")

In [130]:
df_excel_merge

  employee       department  Year  age
0    Julia     Data Science  2005   35
1    Marie  Web Development  2008   40
2     Adam     Data Science  2011   38
3   Nicole   Cyber Security  2002   33
4   Joseph    App Developer  2007   29
5    Kayra     Data Science  2008   27

## Pandas Kütüphanesi İle Veri Çıkışı

### CSV Uzantılı Dosya Çıktısı Alma

In [144]:
import pandas as pd

In [147]:
df1 = pd.DataFrame({'employee': ['Julia', 'Marie', 'Adam', 'Nicole'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'Year': ['2005', '2008', '2011', '2002']})
   
df2 = pd.DataFrame({'employee': ['Nicole', 'Adam', 'Julia', 'Marie'],
                          'country': ['Canada', 'England', 'USA', 'Germany'],
                          'salary': ['22000', '16000', '20000', '17500']})

In [149]:
df1

  employee       department  Year
0    Julia     Data Science  2005
1    Marie  Web Development  2008
2     Adam     Data Science  2011
3   Nicole   Cyber Security  2002

In [151]:
df2

  employee  country salary
0   Nicole   Canada  22000
1     Adam  England  16000
2    Julia      USA  20000
3    Marie  Germany  17500

In [153]:
df3 = pd.merge(df1, df2)

In [155]:
df3

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

### to_csv()

# to_csv() fonksiyonu ile DF yapısını csv dosyasına dönüştürme işlemi yapabiliriz.

In [158]:
df3.to_csv("new_data_merge.csv")

In [165]:
df_csv = pd.read_csv("new_data_merge.csv")
df_csv

   Unnamed: 0 employee       department  Year  country  salary
0           0    Julia     Data Science  2005      USA   20000
1           1    Marie  Web Development  2008  Germany   17500
2           2     Adam     Data Science  2011  England   16000
3           3   Nicole   Cyber Security  2002   Canada   22000

# Yukarıdaki kod blokunda görüldüğü üzere "Unnamed:0" isminde oluşan hatalı gösterimden kurturlmak için index_col parametresini kullanarak istenilen sütunu indeks olarak atamış olduk.

In [167]:
df_csv = pd.read_csv("new_data_merge.csv", index_col = 0) 
df_csv

  employee       department  Year  country  salary
0    Julia     Data Science  2005      USA   20000
1    Marie  Web Development  2008  Germany   17500
2     Adam     Data Science  2011  England   16000
3   Nicole   Cyber Security  2002   Canada   22000

#### **Not:** 
    Yukarıda to_csv() fonksiyonunu kullanarak csv dosyası oluşturduk ve oluşturduğumuz bu dosyasısı tekrar read_csv() fonksiyonunu kullanarak içe aktardık ve DF olarak görüntüledik.Ancak burada Unnamed:0 isminde istenmeyen bir sütun değeri oluştuğunu gördük ve bu hatalı gösterimden kurtulmak için read_csv() fonksiyonu içerisinde yer alan index_col parametresini kullanarak istediğimiz sütun değerini indeks olarak atadık.
    
    Bu hata ile hiç karşılaşmamak için to_csv() fonksiyonu içerisinde csv dosya ismini tanımladıktan sonra index=True olarak öntanımlı olan parametreyi index=False olarak yazıp Python'a csv dosyası oluştururken indeks atama işini iptal et demiş oluruz ve bu şekilde hata giderilmiş olur.

In [176]:
df3.to_csv("no_index_data_merge.csv", index=False)

In [178]:
df_csv_index_false = pd.read_csv("no_index_data_merge.csv")

In [182]:
df_csv_index_false # Görüldüğü üzere indeks hatası ile karşılaşmadık.

  employee       department  Year  country  salary
0    Julia     Data Science  2005      USA   20000
1    Marie  Web Development  2008  Germany   17500
2     Adam     Data Science  2011  England   16000
3   Nicole   Cyber Security  2002   Canada   22000

## Pandas Kütüphanesi İle Veri Çıkışı

### Excel Dosyası Olarak Çıktı Alma

In [188]:
import pandas as pd

In [190]:
df1 = pd.DataFrame({'employee': ['Julia', 'Marie', 'Adam', 'Nicole'],
                     'department': ['Data Science', 'Web Development', 'Data Science', 'Cyber Security'],
                     'Year': ['2005', '2008', '2011', '2002']})
   
df2 = pd.DataFrame({'employee': ['Nicole', 'Adam', 'Julia', 'Marie'],
                          'country': ['Canada', 'England', 'USA', 'Germany'],
                          'salary': ['22000', '16000', '20000', '17500']})

In [192]:
df3 = pd.merge(df1, df2)

In [194]:
df3

  employee       department  Year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [199]:
df3.to_excel("excel_sample.xlsx", sheet_name="Sheet1", index = False)

In [201]:
df_excel3 = pd.read_excel("excel_sample.xlsx")

In [203]:
df_excel3

  employee       department  Year  country  salary
0    Julia     Data Science  2005      USA   20000
1    Marie  Web Development  2008  Germany   17500
2     Adam     Data Science  2011  England   16000
3   Nicole   Cyber Security  2002   Canada   22000